BaseConfiguration/Money_2_0/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Валюта, по отношению к которой хранится курс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ФинансовыеЦели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФинансовыеЦели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеФинансовойЦели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНакопления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Constants/ВалютаУчета/Ext/ValueManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ПрежняяВалютаУчета = ПараметрыСеанса.ВалютаУчета;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Значение) И ПрежняяВалютаУчета <> ЭтотОбъект.Значение Тогда
		
		// В регистре сведений "Курсы валют" устанавливаем курс новой базовой валюты самой к себе = 1
		МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.БазоваяВалюта = ЭтотОбъект.Значение;
		МенеджерЗаписи.Валюта        = ЭтотОбъект.Значение;
		МенеджерЗаписи.Кратность     = 1;
		МенеджерЗаписи.Курс          = 1;
		МенеджерЗаписи.Период        = Дата(1980,1,1);
		МенеджерЗаписи.Записать(Истина);
		
		// Получаем список валют, чьи курсы следует пересчитать. 
		//Заодно проверяем курсы этих валют по отношении к новой валюте учета
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВалютаУчета", ЭтотОбъект.Значение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта,
		|	Валюты.Код,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) КАК Кратность
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, БазоваяВалюта = &ВалютаУчета) КАК КурсыВалютСрезПоследних
		|		ПО (КурсыВалютСрезПоследних.Валюта = Валюты.Ссылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		СписокВалютДляПересчета = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Код <> "643" Тогда
				СписокВалютДляПересчета.Добавить(Новый Структура("Валюта,СтатусОперации", Выборка.Валюта, Истина));
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Выборка.Кратность) Тогда
				МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.БазоваяВалюта = ЭтотОбъект.Значение;
				МенеджерЗаписи.Валюта        = Выборка.Валюта;
				МенеджерЗаписи.Кратность     = 1;
				МенеджерЗаписи.Курс          = 1;
				МенеджерЗаписи.Период        = Дата(1980,1,1);
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли; 
		
		КонецЦикла; 
		
		// Выполним пересчет из рублей в новую базовую валюту:
		Если ЗначениеЗаполнено(ПрежняяВалютаУчета) И ПрежняяВалютаУчета <> ЭтотОбъект.Значение Тогда
			РаботаСКурсамиВалют.ПересчитатьЗагруженныеКурсыВалют(СписокВалютДляПересчета, ПрежняяВалютаУчета, Дата(2000,1,1), КонецГода(ТекущаяДатаСеанса()));
			ОбщегоНазначенияДеньги.ПроверитьРазрывыКурсовВалют();
		КонецЕсли; 
		
		// Обновим связанные константы
		Константы.ВалютаИндикаторовРабочегоСтола.Установить(ЭтотОбъект.Значение);
		
		// Изменяем валюту в предопределенном элементе справочника финановых целей
		СправочникОбъект = Справочники.ФинансовыеЦели.ОбщиеНакопления.ПолучитьОбъект();
		СправочникОбъект.Валюта = ЭтотОбъект.Значение;
		СправочникОбъект.Записать();
		
		// Обновляем параметры сеанса
		ПараметрыСеанса.ВалютаУчета   = ЭтотОбъект.Значение;
		ПараметрыСеанса.ВалютаОтчетов = ЭтотОбъект.Значение;
		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПараметрыСеанса.ВалютаУчета) Тогда
		// Заполнение параметров сеанса при начале работы с пустой базой
		ПараметрыСеанса.ВалютаУчета   = ЭтотОбъект.Значение;
		ПараметрыСеанса.ВалютаОтчетов = ЭтотОбъект.Значение;
	КонецЕсли;
	
КонецПроцедуры



#КонецЕсли
